In [3]:
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# create engine instance using sqlalchemy
engine = create_engine("sqlite:///TMDB.db")
%config SQL.conn_name = 'engine'

# create connection object using sqlite3
conn = sqlite3.connect('TMDB.db')
cursor = conn.cursor()

The sql_magic extension is already loaded. To reload it, use:
  %reload_ext sql_magic

In [6]:
%%read_sql

SELECT name FROM sqlite_master WHERE type='table'

Query started at 10:48:08 AM E. Africa Standard Time; Query executed in 0.00 m

                    name
0                 actors
1                  casts
2               genremap
3                 genres
4             keywordmap
5               keywords
6            languagemap
7              languages
8                 movies
9                 oscars
10   productioncompanies
11  productioncompanymap
12   productioncountries
13  productioncountrymap
14           sysdiagrams

1. What query would you write to change the name of the language with the 'zh' iso code in the "Languages" table to Chinese?

In [10]:
%%read_sql

UPDATE languages
SET language_name = "Chinese"
WHERE iso_639_1 = "zh"

Query started at 11:03:15 AM E. Africa Standard Time; Query executed in 0.00 m

In [11]:
%%read_sql

SELECT * 
FROM languages 
WHERE iso_639_1 = "zh"
LIMIT 10

Query started at 11:03:20 AM E. Africa Standard Time; Query executed in 0.00 m

  iso_639_1 language_name
0        zh       Chinese

2. What query would you write to insert a new genre called Sport with an id of 10?

In [13]:
%%read_sql

INSERT INTO Genres (genre_id, genre_name) Values (10, 'Sport')

Query started at 11:10:58 AM E. Africa Standard Time; Query executed in 0.00 m

In [14]:
%%read_sql
SELECT * FROM genres limit 10

Query started at 11:11:15 AM E. Africa Standard Time; Query executed in 0.00 m

   genre_id genre_name
0        10      Sport
1        12  Adventure
2        14    Fantasy
3        16  Animation
4        18      Drama
5        27     Horror
6        28     Action
7        35     Comedy
8        36    History
9        37    Western

3. You have just watched The Flintstones movie and did not find it very funny. What code would delete the entry that links The Flintstones to the Comedy genre?

In [25]:
%%read_sql

DELETE FROM genremap WHERE genre_id = 35 and movie_id = 888

Query started at 11:24:58 AM E. Africa Standard Time; Query executed in 0.00 m

In [26]:
%%read_sql
SELECT g.movie_id, g.genre_id, m.title 
FROM genremap g
INNER JOIN movies m
ON g.movie_id = m.movie_id
WHERE m.title = "The Flintstones"

Query started at 11:25:06 AM E. Africa Standard Time; Query executed in 0.00 m

   movie_id  genre_id            title
0       888        14  The Flintstones
1       888     10751  The Flintstones

4. What query would you write to add a column to the language table that could be used for the English names of the different languages?

In [27]:
%%read_sql

ALTER TABLE languages 
    ADD language_english_name varchar(50)

Query started at 11:29:52 AM E. Africa Standard Time; Query executed in 0.00 m

In [28]:
%%read_sql

SELECT * FROM languages LIMIT 5

Query started at 11:30:26 AM E. Africa Standard Time; Query executed in 0.00 m

  iso_639_1   language_name language_english_name
0        af       Afrikaans                  None
1        am            None                  None
2        ar         ???????                  None
3        bg  ????????? ????                  None
4        bm      Bamanankan                  None

6. What query would you write to create a new table called Favourites that only has one column for the movie_id?

In [30]:
%%read_sql

CREATE TABLE Favourites ( movie_id int)

Query started at 11:42:27 AM E. Africa Standard Time; Query executed in 0.00 m

In [31]:
%%read_sql

SELECT * FROM Favourites LIMIT 10

Query started at 11:43:06 AM E. Africa Standard Time; Query executed in 0.00 m

Empty DataFrame
Columns: [movie_id]
Index: []

7. When using SQLite, if you want to make sure that you do not put duplicates in your new Favourites table, how would you have created your 'Favourites' table?

In [37]:
%%read_sql

DROP TABLE Favourites;

Query started at 11:49:13 AM E. Africa Standard Time; Query executed in 0.00 m

In [40]:
%%read_sql

CREATE TABLE Favourites (movie_id int unique)

Query started at 11:50:10 AM E. Africa Standard Time; Query executed in 0.00 m

8. When using SQLite, and you want your new 'Favourites' table to also hold the names of your favourite movies. What query would you write to introduce this new column?

In [44]:
%%read_sql

ALTER TABLE Favourites 
    ADD COLUMN movie_name VARCHAR

Query started at 11:54:17 AM E. Africa Standard Time; Query executed in 0.00 m

In [45]:
%%read_sql
select * from Favourites

Query started at 11:54:21 AM E. Africa Standard Time; Query executed in 0.00 m

Empty DataFrame
Columns: [movie_id, movie_name]
Index: []

9. What would the following query do?

INSERT INTO Favourites
SELECT title FROM Movies
WHERE popularity > 100;

In [51]:
%%read_sql

INSERT INTO Favourites
SELECT movie_id, title FROM Movies
WHERE popularity > 100;

Query started at 12:06:40 PM E. Africa Standard Time; Query executed in 0.00 m

In [52]:
%%read_sql

SELECT * FROM Favourites LIMIT 20

Query started at 12:07:19 PM E. Africa Standard Time; Query executed in 0.00 m

    movie_id                                         movie_name
0         11                                          Star Wars
1         13                                       Forrest Gump
2         18                                  The Fifth Element
3         22  Pirates of the Caribbean: The Curse of the Bla...
4         58         Pirates of the Caribbean: Dead Man's Chest
5        120  The Lord of the Rings: The Fellowship of the Ring
6        121              The Lord of the Rings: The Two Towers
7        122      The Lord of the Rings: The Return of the King
8        129                                      Spirited Away
9        155                                    The Dark Knight
10       238                                      The Godfather
11       240                             The Godfather: Part II
12       272                                      Batman Begins
13       278                           The Shawshank Redemption
14       280                         Terminator 2: Judgment Day
15       285           Pirates of the Caribbean: At World's End
16       310                                     Bruce Almighty
17       424                                   Schindler's List
18       497                                     The Green Mile
19       510                    One Flew Over the Cuckoo's Nest

9. What query would you write to delete the table Favourites that we created in the previous question?

In [54]:
%%read_sql

DROP TABLE Favourites

Query started at 12:09:25 PM E. Africa Standard Time; Query executed in 0.00 m

In [55]:
%%read_sql

SELECT *
FROM Favourites

Query started at 12:09:52 PM E. Africa Standard Time

OperationalError: (sqlite3.OperationalError) no such table: Favourites
[SQL: SELECT *
FROM Favourites]
(Background on this error at: http://sqlalche.me/e/13/e3q8)